scratch/tmp/pytest-of-Micha/pytest-0/test_internal_mode_does_not_ad0/internal/system/controlDict
/* GustSim · OpenCFD OpenFOAM v2606 */
FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 object controlDict;
}
application simpleFoam;
startFrom startTime; startTime 0; stopAt endTime; endTime 1000; deltaT 1;
writeControl timeStep; writeInterval 100; purgeWrite 0;
writeFormat binary; writePrecision 10; writeCompression off; timeFormat general; timePrecision 10;
runTimeModifiable false;
functions { loads { type forces; libs ("libforces.so"); patches (surface_2 surface_3 surface_4 surface_5); rho rhoInf; rhoInf 1.204; pRef 0; CofR (0 0 0); log true; writeControl timeStep; writeInterval 1; }
load_surface_2 { type forces; libs ("libforces.so"); patches (surface_2); rho rhoInf; rhoInf 1.204; pRef 0; CofR (0 0 0); log true; writeControl timeStep; writeInterval 1; }
load_surface_3 { type forces; libs ("libforces.so"); patches (surface_3); rho rhoInf; rhoInf 1.204; pRef 0; CofR (0 0 0); log true; writeControl timeStep; writeInterval 1; }
load_surface_4 { type forces; libs ("libforces.so"); patches (surface_4); rho rhoInf; rhoInf 1.204; pRef 0; CofR (0 0 0); log true; writeControl timeStep; writeInterval 1; }
load_surface_5 { type forces; libs ("libforces.so"); patches (surface_5); rho rhoInf; rhoInf 1.204; pRef 0; CofR (0 0 0); log true; writeControl timeStep; writeInterval 1; }
residuals { type solverInfo; libs ("libutilityFunctionObjects.so"); fields (p U); writeControl timeStep; writeInterval 1; }
yPlus { type yPlus; libs ("libfieldFunctionObjects.so"); writeControl writeTime; }
totalPressureField { type pressure; libs (fieldFunctionObjects); mode total; result gustsimTotalPressure; rho rhoInf; rhoInf 1.204; pRef 0; executeControl timeStep; executeInterval 1; writeControl timeStep; writeInterval 1; }
flux_surface_0 { type surfaceFieldValue; libs ("libfieldFunctionObjects.so"); regionType patch; name surface_0; operation sum; fields (phi); writeFields false; writeControl timeStep; writeInterval 1; }
pressure_surface_0 { type surfaceFieldValue; libs ("libfieldFunctionObjects.so"); regionType patch; name surface_0; operation areaAverage; fields (p); writeFields false; writeControl timeStep; writeInterval 1; }
totalpressure_surface_0 { type surfaceFieldValue; libs (fieldFunctionObjects); regionType patch; name surface_0; operation weightedAverage; weightField phi; fields (gustsimTotalPressure); writeFields false; writeControl timeStep; writeInterval 1; }
absoluteFlux_surface_0 { type surfaceFieldValue; libs (fieldFunctionObjects); regionType patch; name surface_0; operation sumMag; fields (phi); writeFields false; writeControl timeStep; writeInterval 1; }
flux_surface_1 { type surfaceFieldValue; libs ("libfieldFunctionObjects.so"); regionType patch; name surface_1; operation sum; fields (phi); writeFields false; writeControl timeStep; writeInterval 1; }
pressure_surface_1 { type surfaceFieldValue; libs ("libfieldFunctionObjects.so"); regionType patch; name surface_1; operation areaAverage; fields (p); writeFields false; writeControl timeStep; writeInterval 1; }
totalpressure_surface_1 { type surfaceFieldValue; libs (fieldFunctionObjects); regionType patch; name surface_1; operation weightedAverage; weightField phi; fields (gustsimTotalPressure); writeFields false; writeControl timeStep; writeInterval 1; }
absoluteFlux_surface_1 { type surfaceFieldValue; libs (fieldFunctionObjects); regionType patch; name surface_1; operation sumMag; fields (phi); writeFields false; writeControl timeStep; writeInterval 1; } }
