scratch/tmp/pytest-of-Micha/pytest-0/test_internal_mode_does_not_ad0/internal/system/blockMeshDict
/* GustSim · OpenCFD OpenFOAM v2606 */
FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 object blockMeshDict;
}
scale 1;
vertices
(
(-7 -6.5 -6.5)
(17 -6.5 -6.5)
(17 6.5 -6.5)
(-7 6.5 -6.5)
(-7 -6.5 6.5)
(17 -6.5 6.5)
(17 6.5 6.5)
(-7 6.5 6.5)
);
blocks
( hex (0 1 2 3 4 5 6 7) (24 13 13) simpleGrading (1 1 1) );
edges ();
boundary
(
inlet { type patch; faces ((0 4 7 3)); }
outlet { type patch; faces ((1 2 6 5)); }
front { type patch; faces ((0 1 5 4)); }
back { type patch; faces ((3 7 6 2)); }
ground { type patch; faces ((0 3 2 1)); }
top { type patch; faces ((4 5 6 7)); }
);
mergePatchPairs ();
