scratch/tmp/pytest-of-Micha/pytest-0/test_internal_mode_does_not_ad0/internal/system/snappyHexMeshDict
/* GustSim · OpenCFD OpenFOAM v2606 */
FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 object snappyHexMeshDict;
}

castellatedMesh true;
snap true;
addLayers true;
geometry { surface_0.stl { type triSurfaceMesh; name surface_0; }
surface_1.stl { type triSurfaceMesh; name surface_1; }
surface_2.stl { type triSurfaceMesh; name surface_2; }
surface_3.stl { type triSurfaceMesh; name surface_3; }
surface_4.stl { type triSurfaceMesh; name surface_4; }
surface_5.stl { type triSurfaceMesh; name surface_5; }
bodyResolution { type searchableBox; min (-1.25 -0.75 -0.75); max (1.25 0.75 0.75); } }
castellatedMeshControls
{
 maxLocalCells 2000000; maxGlobalCells 2000000; minRefinementCells 0;
 maxLoadUnbalance 0.1; nCellsBetweenLevels 3;
 features ({ file "surface_0.eMesh"; level 3; }
{ file "surface_1.eMesh"; level 3; }
{ file "surface_2.eMesh"; level 3; }
{ file "surface_3.eMesh"; level 3; }
{ file "surface_4.eMesh"; level 3; }
{ file "surface_5.eMesh"; level 3; });
 refinementSurfaces { surface_0 { level (2 2); patchInfo { type patch; } }
surface_1 { level (2 2); patchInfo { type patch; } }
surface_2 { level (2 2); patchInfo { type wall; } }
surface_3 { level (2 2); patchInfo { type wall; } }
surface_4 { level (2 2); patchInfo { type wall; } }
surface_5 { level (2 2); patchInfo { type wall; } } }
 resolveFeatureAngle 30;
 refinementRegions { bodyResolution { mode inside; levels ((1e15 3)); } }
 locationInMesh (0 0 0);
 allowFreeStandingZoneFaces true;
}
snapControls { nSmoothPatch 3; tolerance 2; nSolveIter 30; nRelaxIter 5; nFeatureSnapIter 10; implicitFeatureSnap false; explicitFeatureSnap true; multiRegionFeatureSnap true; }
addLayersControls
{
 relativeSizes false;
 layers { surface_2 { nSurfaceLayers 3; }
surface_3 { nSurfaceLayers 3; }
surface_4 { nSurfaceLayers 3; }
surface_5 { nSurfaceLayers 3; } }
 expansionRatio 1.2; firstLayerThickness 0.0019523143578110637; minThickness 0.00019523143578110638;
 nGrow 0; featureAngle 60; slipFeatureAngle 30; nRelaxIter 3; nSmoothSurfaceNormals 1;
 nSmoothNormals 3; nSmoothThickness 10; maxFaceThicknessRatio 0.5; maxThicknessToMedialRatio 0.3;
 minMedialAxisAngle 90; nBufferCellsNoExtrude 0; nLayerIter 50; nRelaxedIter 20;
}
meshQualityControls
{
 maxNonOrtho 65; maxBoundarySkewness 20; maxInternalSkewness 4; maxConcave 80;
 minVol 1e-13; minTetQuality 1e-15; minArea -1; minTwist 0.02;
 minDeterminant 0.001; minFaceWeight 0.02; minVolRatio 0.01; minTriangleTwist -1;
 nSmoothScale 4; errorReduction 0.75; relaxed { maxNonOrtho 75; }
}
writeFlags (scalarLevels layerSets layerFields);
mergeTolerance 1e-6;

