scratch/tmp/pytest-of-Micha/pytest-0/test_internal_mode_does_not_ad0/internal/0/U
/* GustSim · OpenCFD OpenFOAM v2606 */
FoamFile
{
 version 2.0;
 format ascii;
 class volVectorField;
 object U;
}
dimensions [0 1 -1 0 0 0 0];
internalField uniform (20 0 0);
boundaryField
{
surface_0 { type fixedValue; value uniform (1 0 0); }
surface_1 { type pressureInletOutletVelocity; value uniform (0 0 0); }
surface_2 { type fixedValue; value uniform (0 0 0); }
surface_3 { type fixedValue; value uniform (0 0 0); }
surface_4 { type fixedValue; value uniform (0 0 0); }
surface_5 { type fixedValue; value uniform (0 0 0); }
}
