scratch/tmp/pytest-of-Micha/pytest-0/test_internal_mode_does_not_ad0/internal/system/decomposeParDict
/* GustSim · OpenCFD OpenFOAM v2606 */
FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 object decomposeParDict;
}
numberOfSubdomains 4;
method scotch;
